Repository: strawbees/code-ui
Catalog: data/i18n/translations/coding_cards/*.po
Languages: pt_br, sv

# coding_cards.flow.title
source: Flow coding cards
pt_br: Cartas de programação Flow
sv: Flödesprogrammeringskort

# coding_cards.block.title
source: Block coding cards
pt_br: Cartas de programação Block
sv: Blockprogrammeringskort

# coding_cards.back-to-coding-cards
source: Back to cards
pt_br: Voltar às cartas
sv: Tillbaka till korten

# coding_cards.open-program
source: Open in editor
pt_br: Abrir no editor
sv: Öppna i editor

# coding_cards.hardware.built-in-led.title
source: Built-in LED
pt_br: LED embutido
sv: Inbyggd LED

# coding_cards.hardware.dual-color-led.title
source: Dual color LED
pt_br: LED de duas cores
sv: Tvåfärgad LED

# coding_cards.hardware.servo-motor.title
source: Servo Motor
pt_br: Servo

# coding_cards.hardware.key-press.title
source: Key Press
pt_br: Pressionar tecla
sv: Tangenttryckning

# coding_cards.hardware.buzzer.title
source: Buzzer
pt_br: Campainha
sv: Summer

# coding_cards.hardware.circuit-touch.title
source: Circuit Touch
pt_br: Circuito de toque
sv: Beröringssensor

# coding_cards.hardware.light-sensor.title
source: Light Sensor
pt_br: Sensor de luminosidade
sv: Ljussensor

# coding_cards.block.slide.code-and-hardware.title
source: Code & Hardware Requirements
pt_br: Programa e material necessário
sv: Kod & Systemkrav

# coding_cards.block.slide.assembly.title
source: How to use the hardware
pt_br: Como usar o material
sv: Att använda hårdvaran

# coding_cards.block.card.blink.title
source: Blink
pt_br: Piscar
sv: Blinka

# coding_cards.block.card.touch-and-wink.title
source: Touch and wink
pt_br: Toque para piscar uma vez
sv: Rör vid för att blinka

# coding_cards.block.card.touch-to-shine.title
source: Touch to shine
pt_br: Toque para acender
sv: Rör vid för att lysa

# coding_cards.block.card.shine-in-the-dark.title
source: Shine in the dark
pt_br: Acender no escuro
sv: Lys i mörkret

# coding_cards.block.card.flicker.title
source: Flicker
pt_br: Cintilar
sv: Flimra

# coding_cards.block.card.glow.title
source: Glow
pt_br: Acender suavemente
sv: Glöd

# coding_cards.block.card.light-switch.title
source: Light switch
pt_br: Interruptor de luz
sv: Ljusbrytare

# coding_cards.block.card.switching-colors.title
source: Switching colors
pt_br: Trocar de cores
sv: Växla färg

# coding_cards.block.card.touch-to-siren-light.title
source: Touch to siren light
pt_br: Toque para ligar a luz de sirene
sv: Rör vid för sirenljus

# coding_cards.block.card.touch-to-change-color.title
source: Touch to change color
pt_br: Toque para mudar de cor
sv: Rör vid för att ändra färg

# coding_cards.block.card.change-color-in-the-dark.title
source: Change color in the dark
pt_br: Trocar de cor no escuro
sv: Växla färg i mörkret

# coding_cards.block.card.flickering-color.title
source: Flickering color
pt_br: Cor cintilante
sv: Flimrande färg

# coding_cards.block.card.fading-colors.title
source: Fading colors
pt_br: Trocar de cor suavemente
sv: Dimmande färger

# coding_cards.block.card.mood-light-switch.title
source: Mood light switch
pt_br: Interruptor de luz de cores
sv: Stämningsbelysningsbrytare

# coding_cards.block.card.back-and-forth.title
source: Back and forth
pt_br: Vai-e-volta
sv: Fram och tillbaka

# coding_cards.block.card.touch-and-trap.title
source: Touch and trap
pt_br: Toque e prenda
sv: Rör vid och fånga

# coding_cards.block.card.touch-to-hold-position.title
source: Touch to hold position
pt_br: Toque para segurar a posição
sv: Rör vid för att hålla position

# coding_cards.block.card.shake-in-the-dark.title
source: Shake in the dark
pt_br: Tremer no escuro
sv: Skaka i mörkret

# coding_cards.block.card.shake.title
source: Shake
pt_br: Tremer
sv: Skaka

# coding_cards.block.card.sweep.title
source: Sweep
pt_br: Movimento de varredura
sv: Svep

# coding_cards.block.card.touch-to-switch-position.title
source: Touch to switch position
pt_br: Toque para trocar de posição
sv: Rör vid för att byta position

# coding_cards.block.card.type-a-key-over-and-over.title
source: Type a key over and over
pt_br: Tecle repetidamente
sv: Tryck ner tangent om och om igen

# coding_cards.block.card.touch-to-write-a-word.title
source: Touch to write a word
pt_br: Toque para escrever uma palavra
sv: Rör vid för att skriva ett ord

# coding_cards.block.card.touch-to-steer.title
source: Touch to steer
pt_br: Toque para controlar
sv: Rör vid för att styra

# coding_cards.block.card.press-a-key-in-the-dark.title
source: Press a key in the dark
pt_br: Apertar uma tecla no escuro
sv: Tryck på en tangent när det är mörkt

# coding_cards.block.card.laughter-generator.title
source: Laughter generator
pt_br: Gerador de risadas
sv: Skrattgenerator

# coding_cards.block.card.type-a-sequence-of-letters.title
source: Type a sequence of letters
pt_br: Tecle uma sequencia de letras
sv: Skriv en sekvens av bokstäver

# coding_cards.block.card.touch-to-alternate-keys.title
source: Touch to alternate keys
pt_br: Toque para alternar teclas
sv: Rör vid för att växla tangent

# coding_cards.flow.card.advance-motor-position.title
source: Advance motor position
pt_br: Avançar a posição do motor

# coding_cards.flow.card.back-and-forth.title
source: Back and forth
pt_br: Vai e volta

# coding_cards.flow.card.blink-randomly-30percent-of-the-time.title
source: Blink randomly 30% of the time
pt_br: Piscar aleatoriamente 30% do tempo

# coding_cards.flow.card.blink.title
source: Blink
pt_br: Piscar

# coding_cards.flow.card.change-both-color-and-brightness.title
source: Change both color and brightness
pt_br: Trocar, ambos, cor e luminosidade

# coding_cards.flow.card.change-fade-speed.title
source: Change fade speed
pt_br: Trocar velocidade da mudança de luz

# coding_cards.flow.card.change-movement-amplitude.title
source: Change movement amplitude
pt_br: Trocar amplitude do movimento

# coding_cards.flow.card.circle-leds.title
source: Circle LEDs
pt_br: Circular LEDs

# coding_cards.flow.card.complex-brightness-change.title
source: Complex brightness change
pt_br: Mudança de luminosidade complexa

# coding_cards.flow.card.control-2-leds.title
source: Control 2 LEDs
pt_br: Controlar 2 LEDs

# coding_cards.flow.card.control-motor-and-led.title
source: Control Motor and LED
pt_br: Controlar servo e LED

# coding_cards.flow.card.double-oscillation.title
source: Double oscillation
pt_br: Oscilação dupla

# coding_cards.flow.card.flicker.title
source: Flicker
pt_br: Cintilar

# coding_cards.flow.card.light-to-different-movements.title
source: Light to different movements
pt_br: Usar luz para mudar o movimento

# coding_cards.flow.card.move-randomly.title
source: Move Randomly
pt_br: Mover aleatoriamente

# coding_cards.flow.card.move-and-blink-independently.title
source: Move and blink independently
pt_br: Mover and piscar independentemente

# coding_cards.flow.card.move-in-the-dark.title
source: Move in the dark
pt_br: Mover no escuro

# coding_cards.flow.card.press-left-and-right-keys.title
source: Press left and right keys
pt_br: Tecle as setas da esquerda e da direita

# coding_cards.flow.card.random-color.title
source: Random Color
pt_br: Cor aleatória

# coding_cards.flow.card.shake.title
source: Shake
pt_br: Tremer

# coding_cards.flow.card.shine-in-the-dark.title
source: Shine in the dark
pt_br: Acender no escuro

# coding_cards.flow.card.switch-fast-and-slow-movement.title
source: Switch fast and slow movement
pt_br: Alternar movimento rápido e devagar

# coding_cards.flow.card.switch-steady-and-random-light.title
source: Switch steady and random light
pt_br: Alternar luz constante e aleatória

# coding_cards.flow.card.switch-twinkle-eye.title
source: Switch twinkle eye
pt_br: Trocar o LED que está cintilando

# coding_cards.flow.card.touch-light-switch.title
source: Touch light switch
pt_br: Interruptor de luz

# coding_cards.flow.card.touch-to-change-color-10-times.title
source: Touch to change color 10 times
pt_br: Toque para mudar de cor 10 vezes

# coding_cards.flow.card.touch-to-light.title
source: Touch to light
pt_br: Toque para anceder

# coding_cards.flow.card.touch-to-move.title
source: Touch to move
pt_br: Toque para mover

# coding_cards.flow.card.touch-to-siren-light.title
source: Touch to siren light
pt_br: Toque para ligar a luz de sirene

# coding_cards.flow.card.touch-to-wave.title
source: Touch to wave
pt_br: Toque para mover em vai e vem

# coding_cards.flow.card.touch-to-wink.title
source: Touch to wink
pt_br: Toque para piscar uma vez

# coding_cards.flow.card.trigger-movement-pattern.title
source: Trigger movement pattern
pt_br: Ativar sequência de movimentos

# coding_cards.flow.card.twinkle-for-4-seconds-at-startup.title
source: Twinkle for 4 seconds at startup
pt_br: Cintilar por 4 segundos somente no início

# coding_cards.flow.card.type-key-over-and-over.title
source: Type key over and over
pt_br: Tecle repetidamente

# coding_cards.flow.card.wave-quick-ands-slow.title
source: Wave quick ands slow
pt_br: Oscilar rápido e devagar

# coding_cards.flow.card.write-hello-in-one-second.title
source: Write HELLO in one second
pt_br: Escreva HELLO em um segundo
